vintagepc/MINI404/hw/arm/prusa/stm32_registers/generated/common/EXTI_TYPE_A_registers.h
/* Common EXTI_TYPE_A — generated by stm32_reggen.py.
 * Do not edit this file manually!
 * Superset across: stm32g070, stm32h503, stm32c092
 */

#pragma once
#include "../../stm32_gen_common.h"
#include "EXTI_TYPE_A_index.h"

typedef union {
	struct {
		uint32_t RT0           : 1; // /*!< Rising trigger configuration for input line 0 */
		uint32_t RT1           : 1; // /*!< Rising trigger configuration for input line 1 */
		uint32_t RT2           : 1; // /*!< Rising trigger configuration for input line 2 */
		uint32_t RT3           : 1; // /*!< Rising trigger configuration for input line 3 */
		uint32_t RT4           : 1; // /*!< Rising trigger configuration for input line 4 */
		uint32_t RT5           : 1; // /*!< Rising trigger configuration for input line 5 */
		uint32_t RT6           : 1; // /*!< Rising trigger configuration for input line 6 */
		uint32_t RT7           : 1; // /*!< Rising trigger configuration for input line 7 */
		uint32_t RT8           : 1; // /*!< Rising trigger configuration for input line 8 */
		uint32_t RT9           : 1; // /*!< Rising trigger configuration for input line 9 */
		uint32_t RT10          : 1; // /*!< Rising trigger configuration for input line 10 */
		uint32_t RT11          : 1; // /*!< Rising trigger configuration for input line 11 */
		uint32_t RT12          : 1; // /*!< Rising trigger configuration for input line 12 */
		uint32_t RT13          : 1; // /*!< Rising trigger configuration for input line 13 */
		uint32_t RT14          : 1; // /*!< Rising trigger configuration for input line 14 */
		uint32_t RT15          : 1; // /*!< Rising trigger configuration for input line 15 */
		uint32_t RT16          : 1; // /*!< Rising trigger configuration for input line 16 */
		uint32_t _reserved17   :15;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_exti_type_a,rtsr1);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_exti_type_a,rtsr1),bits);

typedef union {
	struct {
		uint32_t FT0           : 1; // /*!< Falling trigger configuration for input line 0 */
		uint32_t FT1           : 1; // /*!< Falling trigger configuration for input line 1 */
		uint32_t FT2           : 1; // /*!< Falling trigger configuration for input line 2 */
		uint32_t FT3           : 1; // /*!< Falling trigger configuration for input line 3 */
		uint32_t FT4           : 1; // /*!< Falling trigger configuration for input line 4 */
		uint32_t FT5           : 1; // /*!< Falling trigger configuration for input line 5 */
		uint32_t FT6           : 1; // /*!< Falling trigger configuration for input line 6 */
		uint32_t FT7           : 1; // /*!< Falling trigger configuration for input line 7 */
		uint32_t FT8           : 1; // /*!< Falling trigger configuration for input line 8 */
		uint32_t FT9           : 1; // /*!< Falling trigger configuration for input line 9 */
		uint32_t FT10          : 1; // /*!< Falling trigger configuration for input line 10 */
		uint32_t FT11          : 1; // /*!< Falling trigger configuration for input line 11 */
		uint32_t FT12          : 1; // /*!< Falling trigger configuration for input line 12 */
		uint32_t FT13          : 1; // /*!< Falling trigger configuration for input line 13 */
		uint32_t FT14          : 1; // /*!< Falling trigger configuration for input line 14 */
		uint32_t FT15          : 1; // /*!< Falling trigger configuration for input line 15 */
		uint32_t FT16          : 1; // /*!< Falling trigger configuration for input line 16 */
		uint32_t _reserved17   :15;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_exti_type_a,ftsr1);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_exti_type_a,ftsr1),bits);

typedef union {
	struct {
		uint32_t SWI0          : 1; // /*!< Software Interrupt on line 0 */
		uint32_t SWI1          : 1; // /*!< Software Interrupt on line 1 */
		uint32_t SWI2          : 1; // /*!< Software Interrupt on line 2 */
		uint32_t SWI3          : 1; // /*!< Software Interrupt on line 3 */
		uint32_t SWI4          : 1; // /*!< Software Interrupt on line 4 */
		uint32_t SWI5          : 1; // /*!< Software Interrupt on line 5 */
		uint32_t SWI6          : 1; // /*!< Software Interrupt on line 6 */
		uint32_t SWI7          : 1; // /*!< Software Interrupt on line 7 */
		uint32_t SWI8          : 1; // /*!< Software Interrupt on line 8 */
		uint32_t SWI9          : 1; // /*!< Software Interrupt on line 9 */
		uint32_t SWI10         : 1; // /*!< Software Interrupt on line 10 */
		uint32_t SWI11         : 1; // /*!< Software Interrupt on line 11 */
		uint32_t SWI12         : 1; // /*!< Software Interrupt on line 12 */
		uint32_t SWI13         : 1; // /*!< Software Interrupt on line 13 */
		uint32_t SWI14         : 1; // /*!< Software Interrupt on line 14 */
		uint32_t SWI15         : 1; // /*!< Software Interrupt on line 15 */
		uint32_t SWI16         : 1; // /*!< Software Interrupt on line 16 */
		uint32_t _reserved17   :15;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_exti_type_a,swier1);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_exti_type_a,swier1),bits);

typedef union {
	struct {
		uint32_t RPIF0         : 1; // /*!< Rising Pending Interrupt Flag on line 0 */
		uint32_t RPIF1         : 1; // /*!< Rising Pending Interrupt Flag on line 1 */
		uint32_t RPIF2         : 1; // /*!< Rising Pending Interrupt Flag on line 2 */
		uint32_t RPIF3         : 1; // /*!< Rising Pending Interrupt Flag on line 3 */
		uint32_t RPIF4         : 1; // /*!< Rising Pending Interrupt Flag on line 4 */
		uint32_t RPIF5         : 1; // /*!< Rising Pending Interrupt Flag on line 5 */
		uint32_t RPIF6         : 1; // /*!< Rising Pending Interrupt Flag on line 6 */
		uint32_t RPIF7         : 1; // /*!< Rising Pending Interrupt Flag on line 7 */
		uint32_t RPIF8         : 1; // /*!< Rising Pending Interrupt Flag on line 8 */
		uint32_t RPIF9         : 1; // /*!< Rising Pending Interrupt Flag on line 9 */
		uint32_t RPIF10        : 1; // /*!< Rising Pending Interrupt Flag on line 10 */
		uint32_t RPIF11        : 1; // /*!< Rising Pending Interrupt Flag on line 11 */
		uint32_t RPIF12        : 1; // /*!< Rising Pending Interrupt Flag on line 12 */
		uint32_t RPIF13        : 1; // /*!< Rising Pending Interrupt Flag on line 13 */
		uint32_t RPIF14        : 1; // /*!< Rising Pending Interrupt Flag on line 14 */
		uint32_t RPIF15        : 1; // /*!< Rising Pending Interrupt Flag on line 15 */
		uint32_t RPIF16        : 1; // /*!< Rising Pending Interrupt Flag on line 16 */
		uint32_t _reserved17   :15;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_exti_type_a,rpr1);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_exti_type_a,rpr1),bits);

