vintagepc/MINI404/hw/arm/prusa/stm32_registers/generated/common/EXTI_TYPE_A_registers.h
typedef union {
	struct {
		uint32_t FPIF0         : 1; // /*!< Falling Pending Interrupt Flag on line 0 */
		uint32_t FPIF1         : 1; // /*!< Falling Pending Interrupt Flag on line 1 */
		uint32_t FPIF2         : 1; // /*!< Falling Pending Interrupt Flag on line 2 */
		uint32_t FPIF3         : 1; // /*!< Falling Pending Interrupt Flag on line 3 */
		uint32_t FPIF4         : 1; // /*!< Falling Pending Interrupt Flag on line 4 */
		uint32_t FPIF5         : 1; // /*!< Falling Pending Interrupt Flag on line 5 */
		uint32_t FPIF6         : 1; // /*!< Falling Pending Interrupt Flag on line 6 */
		uint32_t FPIF7         : 1; // /*!< Falling Pending Interrupt Flag on line 7 */
		uint32_t FPIF8         : 1; // /*!< Falling Pending Interrupt Flag on line 8 */
		uint32_t FPIF9         : 1; // /*!< Falling Pending Interrupt Flag on line 9 */
		uint32_t FPIF10        : 1; // /*!< Falling Pending Interrupt Flag on line 10 */
		uint32_t FPIF11        : 1; // /*!< Falling Pending Interrupt Flag on line 11 */
		uint32_t FPIF12        : 1; // /*!< Falling Pending Interrupt Flag on line 12 */
		uint32_t FPIF13        : 1; // /*!< Falling Pending Interrupt Flag on line 13 */
		uint32_t FPIF14        : 1; // /*!< Falling Pending Interrupt Flag on line 14 */
		uint32_t FPIF15        : 1; // /*!< Falling Pending Interrupt Flag on line 15 */
		uint32_t FPIF16        : 1; // /*!< Falling Pending Interrupt Flag on line 16 */
		uint32_t _reserved17   :15;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_exti_type_a,fpr1);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_exti_type_a,fpr1),bits);

typedef union {
	struct {
		uint32_t PRIV0         : 1; // /*!< Privilege enable on line 0 */
		uint32_t PRIV1         : 1; // /*!< Privilege enable on line 1 */
		uint32_t PRIV2         : 1; // /*!< Privilege enable on line 2 */
		uint32_t PRIV3         : 1; // /*!< Privilege enable on line 3 */
		uint32_t PRIV4         : 1; // /*!< Privilege enable on line 4 */
		uint32_t PRIV5         : 1; // /*!< Privilege enable on line 5 */
		uint32_t PRIV6         : 1; // /*!< Privilege enable on line 6 */
		uint32_t PRIV7         : 1; // /*!< Privilege enable on line 7 */
		uint32_t PRIV8         : 1; // /*!< Privilege enable on line 8 */
		uint32_t PRIV9         : 1; // /*!< Privilege enable on line 9 */
		uint32_t PRIV10        : 1; // /*!< Privilege enable on line 10 */
		uint32_t PRIV11        : 1; // /*!< Privilege enable on line 11 */
		uint32_t PRIV12        : 1; // /*!< Privilege enable on line 12 */
		uint32_t PRIV13        : 1; // /*!< Privilege enable on line 13 */
		uint32_t PRIV14        : 1; // /*!< Privilege enable on line 14 */
		uint32_t PRIV15        : 1; // /*!< Privilege enable on line 15 */
		uint32_t PRIV16        : 1; // /*!< Privilege enable on line 16 */
		uint32_t PRIV17        : 1; // /*!< Privilege enable on line 17 */
		uint32_t _reserved18   : 1;
		uint32_t PRIV19        : 1; // /*!< Privilege enable on line 19 */
		uint32_t _reserved20   : 1;
		uint32_t PRIV21        : 1; // /*!< Privilege enable on line 21 */
		uint32_t PRIV22        : 1; // /*!< Privilege enable on line 22 */
		uint32_t _reserved23   : 1;
		uint32_t PRIV24        : 1; // /*!< Privilege enable on line 24 */
		uint32_t PRIV25        : 1; // /*!< Privilege enable on line 25 */
		uint32_t PRIV26        : 1; // /*!< Privilege enable on line 26 */
		uint32_t PRIV27        : 1; // /*!< Privilege enable on line 27 */
		uint32_t PRIV28        : 1; // /*!< Privilege enable on line 28 */
		uint32_t PRIV29        : 1; // /*!< Privilege enable on line 29 */
		uint32_t _reserved30   : 2;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_exti_type_a,privenr1);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_exti_type_a,privenr1),bits);

typedef union {
	struct {
		uint32_t _reserved0    :16;
		uint32_t RT            : 1; // /*!< Rising trigger event configuration bit */
		uint32_t _reserved17   : 1;
		uint32_t RT50          : 1; // /*!< Rising trigger event configuration bit of line 50 */
		uint32_t _reserved19   : 2;
		uint32_t RT53          : 1; // /*!< Rising trigger event configuration bit of line 53 */
		uint32_t _reserved22   :10;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_exti_type_a,rtsr2);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_exti_type_a,rtsr2),bits);

typedef union {
	struct {
		uint32_t _reserved0    :16;
		uint32_t FT            : 1; // /*!< Falling trigger event configuration bit */
		uint32_t _reserved17   : 1;
		uint32_t FT50          : 1; // /*!< Falling trigger event configuration bit of line 50 */
		uint32_t _reserved19   : 2;
		uint32_t FT53          : 1; // /*!< Falling trigger event configuration bit of line 53 */
		uint32_t _reserved22   :10;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_exti_type_a,ftsr2);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_exti_type_a,ftsr2),bits);

typedef union {
	struct {
		uint32_t _reserved0    :18;
		uint32_t SWIER50       : 1; // /*!< Software Interrupt on line 50 */
		uint32_t _reserved19   : 2;
		uint32_t SWIER53       : 1; // /*!< Software Interrupt on line 53 */
		uint32_t _reserved22   :10;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_exti_type_a,swier2);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_exti_type_a,swier2),bits);

typedef union {
	struct {
		uint32_t _reserved0    :16;
		uint32_t RPIF          : 1; // /*!< Rising pending edge configuration bits */
		uint32_t _reserved17   : 1;
		uint32_t RPIF50        : 1; // /*!< Rising pending edge configuration bit of line 50 */
		uint32_t _reserved19   : 2;
		uint32_t RPIF53        : 1; // /*!< Rising pending edge configuration bit of line 53 */
		uint32_t _reserved22   :10;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_exti_type_a,rpr2);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_exti_type_a,rpr2),bits);

typedef union {
	struct {
		uint32_t _reserved0    :16;
		uint32_t FPIF          : 1; // /*!< Rising falling edge configuration bits */
		uint32_t _reserved17   : 1;
		uint32_t FPIF50        : 1; // /*!< Rising falling edge configuration bit of line 50 */
		uint32_t _reserved19   : 2;
		uint32_t FPIF53        : 1; // /*!< Rising falling edge configuration bit of line 53 */
		uint32_t _reserved22   :10;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_exti_type_a,fpr2);
