vintagepc/MINI404/hw/arm/prusa/stm32_registers/generated/common/EXTI_TYPE_A_registers.h
CHECK_TYPEDEF_u32(REGDEF_NAME(com_exti_type_a,fpr2),bits);

typedef union {
	struct {
		uint32_t _reserved0    : 5;
		uint32_t PRIV37        : 1; // /*!< Security enable on line 5 */
		uint32_t PRIV38        : 1; // /*!< Security enable on line 6 */
		uint32_t PRIV39        : 1; // /*!< Security enable on line 7 */
		uint32_t PRIV40        : 1; // /*!< Security enable on line 8 */
		uint32_t PRIV41        : 1; // /*!< Security enable on line 9 */
		uint32_t PRIV42        : 1; // /*!< Security enable on line 10 */
		uint32_t _reserved11   : 4;
		uint32_t PRIV47        : 1; // /*!< Security enable on line 15 */
		uint32_t _reserved16   : 1;
		uint32_t PRIV49        : 1; // /*!< Security enable on line 17 */
		uint32_t PRIV50        : 1; // /*!< Security enable on line 18 */
		uint32_t _reserved19   : 2;
		uint32_t PRIV53        : 1; // /*!< Security enable on line 21 */
		uint32_t _reserved22   :10;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_exti_type_a,privenr2);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_exti_type_a,privenr2),bits);

typedef union {
	struct {
		uint32_t EXTI0         : 3; // /*!< EXTI 0 configuration */
		uint32_t _reserved3    : 5;
		uint32_t EXTI1         : 3; // /*!< EXTI 1 configuration */
		uint32_t _reserved11   : 5;
		uint32_t EXTI2         : 3; // /*!< EXTI 2 configuration */
		uint32_t _reserved19   : 5;
		uint32_t EXTI3         : 3; // /*!< EXTI 3 configuration */
		uint32_t _reserved27   : 5;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_exti_type_a,exticr1);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_exti_type_a,exticr1),bits);

typedef union {
	struct {
		uint32_t EXTI4         : 3; // /*!< EXTI 4 configuration */
		uint32_t _reserved3    : 5;
		uint32_t EXTI5         : 3; // /*!< EXTI 5 configuration */
		uint32_t _reserved11   : 5;
		uint32_t EXTI6         : 3; // /*!< EXTI 6 configuration */
		uint32_t _reserved19   : 5;
		uint32_t EXTI7         : 3; // /*!< EXTI 7 configuration */
		uint32_t _reserved27   : 5;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_exti_type_a,exticr2);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_exti_type_a,exticr2),bits);

typedef union {
	struct {
		uint32_t EXTI8         : 3; // /*!< EXTI 8 configuration */
		uint32_t _reserved3    : 5;
		uint32_t EXTI9         : 3; // /*!< EXTI 9 configuration */
		uint32_t _reserved11   : 5;
		uint32_t EXTI10        : 3; // /*!< EXTI 10 configuration */
		uint32_t _reserved19   : 5;
		uint32_t EXTI11        : 3; // /*!< EXTI 11 configuration */
		uint32_t _reserved27   : 5;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_exti_type_a,exticr3);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_exti_type_a,exticr3),bits);

typedef union {
	struct {
		uint32_t EXTI12        : 3; // /*!< EXTI 12 configuration */
		uint32_t _reserved3    : 5;
		uint32_t EXTI13        : 3; // /*!< EXTI 13 configuration */
		uint32_t _reserved11   : 5;
		uint32_t EXTI14        : 3; // /*!< EXTI 14 configuration */
		uint32_t _reserved19   : 5;
		uint32_t EXTI15        : 3; // /*!< EXTI 15 configuration */
		uint32_t _reserved27   : 5;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_exti_type_a,exticr4);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_exti_type_a,exticr4),bits);

typedef union {
	struct {
		uint32_t IM            :16; // /*!< Interrupt Mask All */
		uint32_t IM1           : 1; // /*!< Interrupt Mask on line 1 */
		uint32_t IM2           : 1; // /*!< Interrupt Mask on line 2 */
		uint32_t IM3           : 1; // /*!< Interrupt Mask on line 3 */
		uint32_t IM4           : 1; // /*!< Interrupt Mask on line 4 */
		uint32_t IM5           : 1; // /*!< Interrupt Mask on line 5 */
		uint32_t IM6           : 1; // /*!< Interrupt Mask on line 6 */
		uint32_t IM7           : 1; // /*!< Interrupt Mask on line 7 */
		uint32_t IM8           : 1; // /*!< Interrupt Mask on line 8 */
		uint32_t IM9           : 1; // /*!< Interrupt Mask on line 9 */
		uint32_t IM10          : 1; // /*!< Interrupt Mask on line 10 */
		uint32_t IM11          : 1; // /*!< Interrupt Mask on line 11 */
		uint32_t IM12          : 1; // /*!< Interrupt Mask on line 12 */
		uint32_t IM13          : 1; // /*!< Interrupt Mask on line 13 */
		uint32_t IM14          : 1; // /*!< Interrupt Mask on line 14 */
		uint32_t IM15          : 1; // /*!< Interrupt Mask on line 15 */
		uint32_t IM16          : 1; // /*!< Interrupt Mask on line 16 */
		uint32_t IM17          : 1; // /*!< Interrupt Mask on line 17 */
		uint32_t _reserved18   : 1;
		uint32_t IM_1          : 1; 
		uint32_t IM_2          : 1; 
		uint32_t IM_3          : 1; 
		uint32_t IM22          : 1; // /*!< Interrupt Mask on line 22 */
		uint32_t IM23          : 1; // /*!< Interrupt Mask on line 23 */
		uint32_t IM24          : 1; // /*!< Interrupt Mask on line 24 */
		uint32_t IM25          : 1; // /*!< Interrupt Mask on line 25 */
		uint32_t IM26          : 1; // /*!< Interrupt Mask on line 26 */
		uint32_t IM27          : 1; // /*!< Interrupt Mask on line 27 */
		uint32_t IM28          : 1; // /*!< Interrupt Mask on line 28 */
		uint32_t IM29          : 1; // /*!< Interrupt Mask on line 29 */
		uint32_t _reserved30   : 1;
		uint32_t IM31          : 1; // /*!< Interrupt Mask on line 31 */
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_exti_type_a,imr1);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_exti_type_a,imr1),bits);

typedef union {
	struct {
		uint32_t EM0           : 1; // /*!< Event Mask on line 0 */
		uint32_t EM1           : 1; // /*!< Event Mask on line 1 */
		uint32_t EM2           : 1; // /*!< Event Mask on line 2 */
		uint32_t EM3           : 1; // /*!< Event Mask on line 3 */
		uint32_t EM4           : 1; // /*!< Event Mask on line 4 */
		uint32_t EM5           : 1; // /*!< Event Mask on line 5 */
		uint32_t EM6           : 1; // /*!< Event Mask on line 6 */
		uint32_t EM7           : 1; // /*!< Event Mask on line 7 */
		uint32_t EM8           : 1; // /*!< Event Mask on line 8 */
		uint32_t EM9           : 1; // /*!< Event Mask on line 9 */
		uint32_t EM10          : 1; // /*!< Event Mask on line 10 */
		uint32_t EM11          : 1; // /*!< Event Mask on line 11 */
		uint32_t EM12          : 1; // /*!< Event Mask on line 12 */
		uint32_t EM13          : 1; // /*!< Event Mask on line 13 */
		uint32_t EM14          : 1; // /*!< Event Mask on line 14 */
		uint32_t EM15          : 1; // /*!< Event Mask on line 15 */
		uint32_t EM16          : 1; // /*!< Event Mask on line 16 */
		uint32_t EM17          : 1; // /*!< Event Mask on line 17 */
		uint32_t EM18          : 1; // /*!< Event Mask on line 18 */
		uint32_t EM19          : 1; // /*!< Event Mask on line 19 */
		uint32_t _reserved20   : 1;
		uint32_t EM21          : 1; // /*!< Event Mask on line 21 */
		uint32_t EM22          : 1; // /*!< Event Mask on line 22 */
		uint32_t EM23          : 1; // /*!< Event Mask on line 23 */
		uint32_t EM24          : 1; // /*!< Event Mask on line 24 */
		uint32_t EM25          : 1; // /*!< Event Mask on line 25 */
		uint32_t EM26          : 1; // /*!< Event Mask on line 26 */
		uint32_t EM27          : 1; // /*!< Event Mask on line 27 */
		uint32_t EM28          : 1; // /*!< Event Mask on line 28 */
		uint32_t EM29          : 1; // /*!< Event Mask on line 29 */
		uint32_t _reserved30   : 1;
		uint32_t EM31          : 1; // /*!< Event Mask on line 31 */
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_exti_type_a,emr1);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_exti_type_a,emr1),bits);

