vintagepc/MINI404/hw/arm/prusa/stm32_registers/generated/common/EXTI_TYPE_A_registers.h
typedef union {
	struct {
		uint32_t _reserved0    : 5;
		uint32_t IM37          : 1; // /*!< Interrupt Mask on line 37 */
		uint32_t IM38          : 1; // /*!< Interrupt Mask on line 38 */
		uint32_t IM39          : 1; // /*!< Interrupt Mask on line 39 */
		uint32_t IM40          : 1; // /*!< Interrupt Mask on line 40 */
		uint32_t IM41          : 1; // /*!< Interrupt Mask on line 41 */
		uint32_t IM42          : 1; // /*!< Interrupt Mask on line 42 */
		uint32_t _reserved11   : 4;
		uint32_t IM47          : 1; // /*!< Interrupt Mask on line 47 */
		uint32_t _reserved16   : 1;
		uint32_t IM49          : 1; // /*!< Interrupt Mask on line 49 */
		uint32_t IM50          : 1; // /*!< Interrupt Mask on line 50 */
		uint32_t _reserved19   : 2;
		uint32_t IM53          : 1; // /*!< Interrupt Mask on line 53 */
		uint32_t _reserved22   :10;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_exti_type_a,imr2);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_exti_type_a,imr2),bits);

typedef union {
	struct {
		uint32_t _reserved0    : 5;
		uint32_t EM37          : 1; // /*!< Event Mask on line 37*/
		uint32_t EM38          : 1; // /*!< Event Mask on line 38*/
		uint32_t EM39          : 1; // /*!< Event Mask on line 39*/
		uint32_t EM40          : 1; // /*!< Event Mask on line 40*/
		uint32_t EM41          : 1; // /*!< Event Mask on line 41*/
		uint32_t EM42          : 1; // /*!< Event Mask on line 42 */
		uint32_t _reserved11   : 4;
		uint32_t EM47          : 1; // /*!< Event Mask on line 47 */
		uint32_t _reserved16   : 1;
		uint32_t EM49          : 1; // /*!< Event Mask on line 49 */
		uint32_t EM50          : 1; // /*!< Event Mask on line 50 */
		uint32_t _reserved19   : 2;
		uint32_t EM53          : 1; // /*!< Event Mask on line 53 */
		uint32_t _reserved22   :10;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_exti_type_a,emr2);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_exti_type_a,emr2),bits);

typedef union {
	struct {
		REGDEF_NAME(com_exti_type_a,rtsr1) RTSR1;
		REGDEF_NAME(com_exti_type_a,ftsr1) FTSR1;
		REGDEF_NAME(com_exti_type_a,swier1) SWIER1;
		REGDEF_NAME(com_exti_type_a,rpr1) RPR1;
		REGDEF_NAME(com_exti_type_a,fpr1) FPR1;
		uint32_t _reserved0x14;
		REGDEF_NAME(com_exti_type_a,privenr1) PRIVENR1;
		uint32_t _reserved0x1C;
		REGDEF_NAME(com_exti_type_a,rtsr2) RTSR2;
		REGDEF_NAME(com_exti_type_a,ftsr2) FTSR2;
		REGDEF_NAME(com_exti_type_a,swier2) SWIER2;
		REGDEF_NAME(com_exti_type_a,rpr2) RPR2;
		REGDEF_NAME(com_exti_type_a,fpr2) FPR2;
		uint32_t _reserved0x34;
		REGDEF_NAME(com_exti_type_a,privenr2) PRIVENR2;
		uint32_t _reserved0x3C[ 9];
		REGDEF_NAME(com_exti_type_a,exticr1) EXTICR1;
		REGDEF_NAME(com_exti_type_a,exticr2) EXTICR2;
		REGDEF_NAME(com_exti_type_a,exticr3) EXTICR3;
		REGDEF_NAME(com_exti_type_a,exticr4) EXTICR4;
		uint32_t _reserved0x70[ 4];
		REGDEF_NAME(com_exti_type_a,imr1) IMR1;
		REGDEF_NAME(com_exti_type_a,emr1) EMR1;
		uint32_t _reserved0x88[ 2];
		REGDEF_NAME(com_exti_type_a,imr2) IMR2;
		REGDEF_NAME(com_exti_type_a,emr2) EMR2;
	} /*QEMU_PACKED*/;
	uint32_t raw[RI_END];
}  REGDEF_NAME(stm32com,exti_type_a);
QEMU_BUILD_BUG_MSG(sizeof(REGDEF_NAME(stm32com,exti_type_a)) != sizeof(uint32_t)*RI_END , "Structure Size mismatch - expected uint32[RI_END]");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,exti_type_a), RTSR1) != 0, "Offset mismatch for RTSR1");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,exti_type_a), FTSR1) != 4, "Offset mismatch for FTSR1");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,exti_type_a), SWIER1) != 8, "Offset mismatch for SWIER1");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,exti_type_a), RPR1) != 12, "Offset mismatch for RPR1");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,exti_type_a), FPR1) != 16, "Offset mismatch for FPR1");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,exti_type_a), EXTICR1) != 96, "Offset mismatch for EXTICR1");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,exti_type_a), EXTICR2) != 100, "Offset mismatch for EXTICR2");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,exti_type_a), EXTICR3) != 104, "Offset mismatch for EXTICR3");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,exti_type_a), EXTICR4) != 108, "Offset mismatch for EXTICR4");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,exti_type_a), IMR1) != 128, "Offset mismatch for IMR1");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,exti_type_a), EMR1) != 132, "Offset mismatch for EMR1");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,exti_type_a), RTSR2) != 32, "Offset mismatch for RTSR2");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,exti_type_a), FTSR2) != 36, "Offset mismatch for FTSR2");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,exti_type_a), SWIER2) != 40, "Offset mismatch for SWIER2");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,exti_type_a), RPR2) != 44, "Offset mismatch for RPR2");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,exti_type_a), FPR2) != 48, "Offset mismatch for FPR2");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,exti_type_a), IMR2) != 144, "Offset mismatch for IMR2");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,exti_type_a), EMR2) != 148, "Offset mismatch for EMR2");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,exti_type_a), PRIVENR1) != 24, "Offset mismatch for PRIVENR1");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,exti_type_a), PRIVENR2) != 56, "Offset mismatch for PRIVENR2");
